# ML Lab 2
## Arpit Khandelwal 19BCE0888

In [129]:
import pandas as pd
import numpy as np
import sqlite3

### Creating Series

In [130]:
first_series = pd.Series(list('abcdef'))
first_series

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [131]:
country = np.array(['India','USA','Australia','Japan','Russia','UAE','Bulgaria','Singapore','Malaysia'])
ncountry = pd.Series(country)
ncountry

0        India
1          USA
2    Australia
3        Japan
4       Russia
5          UAE
6     Bulgaria
7    Singapore
8     Malaysia
dtype: object

### Access elements

In [132]:
ncountry.loc[0]

'India'

In [133]:
ncountry.iloc[2:6]

2    Australia
3        Japan
4       Russia
5          UAE
dtype: object

### Dataframes

In [134]:
olympic_data = {'HostCity' : ['London','Beijing','Athens','Sydney','Atlanta'],
                'Year' : [2012, 2008, 2004, 2000, 1996],
                'Participants' : [205, 204, 201,200,197]
               }
olympic = pd.DataFrame(olympic_data)
olympic

  HostCity  Year  Participants
0   London  2012           205
1  Beijing  2008           204
2   Athens  2004           201
3   Sydney  2000           200
4  Atlanta  1996           197

In [135]:
olympic['HostCity']

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [136]:
olympic.describe

<bound method NDFrame.describe of   HostCity  Year  Participants
0   London  2012           205
1  Beijing  2008           204
2   Athens  2004           201
3   Sydney  2000           200
4  Atlanta  1996           197>

In [137]:
olympic['Participants greater than 200'] = (olympic['Participants'] > 200)
olympic.head()

  HostCity  Year  Participants  Participants greater than 200
0   London  2012           205                           True
1  Beijing  2008           204                           True
2   Athens  2004           201                           True
3   Sydney  2000           200                          False
4  Atlanta  1996           197                          False

## Vectorizing operation and handling missing values

In [138]:
series1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [139]:
series2 = pd.Series([10,20,30,40,50],index=['d','e','f','g','a'])
series2

d    10
e    20
f    30
g    40
a    50
dtype: int64

In [140]:
series3 = series1+series2
series3

a    51.0
b     NaN
c     NaN
d    14.0
e    25.0
f     NaN
g     NaN
dtype: float64

In [141]:
correctedSeries3 = series3.dropna()
correctedSeries3

a    51.0
d    14.0
e    25.0
dtype: float64

In [142]:
correctedSeries3.fillna(0)
correctedSeries3

a    51.0
d    14.0
e    25.0
dtype: float64

In [143]:
fillNA = series3.fillna(0)
fillNA

a    51.0
b     0.0
c     0.0
d    14.0
e    25.0
f     0.0
g     0.0
dtype: float64

In [144]:
fillNAbeforeSum = series1.add(series2,fill_value=-1)
fillNAbeforeSum

a    51.0
b     1.0
c     2.0
d    14.0
e    25.0
f    29.0
g    39.0
dtype: float64

## Data Operations

In [145]:
movie_rating = { 'movie1' : [5,4,3,2,1],
                'movie2' : [1,2,3,4,5],
}
movie_rating_df = pd.DataFrame(movie_rating, index=['Tom','Bob','Noob','hell','Tim'])
movie_rating_df

      movie1  movie2
Tom        5       1
Bob        4       2
Noob       3       3
hell       2       4
Tim        1       5

In [146]:
def Movie_rate(rating):
    if rating == 5:
        return 'A'
    elif rating == 4:
        return 'B'
    elif rating == 3:
        return 'C'
    else:
        return 'D'

In [147]:
print(Movie_rate(5))

A

In [148]:
movie_rating_df.applymap(Movie_rate)

     movie1 movie2
Tom       A      D
Bob       B      D
Noob      C      C
hell      D      B
Tim       D      A

In [149]:
df_test_scores = pd.DataFrame(
    {
        'Test1': [95,82,92,57,83,79],
        'Test2': [74,84,92,77,79,73]
    },
        index = ['Jack','Lewis','Patrick','Rich','Kelly','Paula']
)

In [150]:
df_test_scores.max()

Test1    95
Test2    92
dtype: int64

In [151]:
df_test_scores.mean()

Test1    81.333333
Test2    79.833333
dtype: float64

In [152]:
df_test_scores.std()

Test1    13.426342
Test2     7.139094
dtype: float64

In [153]:
presidents = {'first' : ['George','Bill','Ronald','George'],
                'last' : ['Bush','Clinton','Regan','Washington']
                }
president_df = pd.DataFrame(presidents)
president_df

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3  George  Washington

In [154]:
grouped = president_df.groupby('first')

grp_data = grouped.get_group('George')
grp_data

    first        last
0  George        Bush
3  George  Washington

In [155]:
president_df.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
3  George  Washington
2  Ronald       Regan

## Data standardization

In [156]:
def standardize(test):
    return (test - test.mean())/test.std()

In [157]:
standardize(df_test_scores['Test1'])

Jack       1.017899
Lewis      0.049654
Patrick    0.794458
Rich      -1.812358
Kelly      0.124134
Paula     -0.173788
Name: Test1, dtype: float64

In [158]:
def standardize_scores(dataframe):
    return dataframe.apply(standardize)

In [159]:
standardize_scores(df_test_scores)

            Test1     Test2
Jack     1.017899 -0.817097
Lewis    0.049654  0.583641
Patrick  0.794458  1.704231
Rich    -1.812358 -0.396876
Kelly    0.124134 -0.116728
Paula   -0.173788 -0.957171

## Pandas SQL Operations

In [173]:
create_table = """
CREATE TABLE student_marks (id INTEGER, name VARCHAR(50), math REAL, science REAL, social_std REAL, english REAL);"""

In [174]:
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [175]:
SQL_query_insert = executeSQL.execute("insert into student_marks values(1, 'SRamanujan', 99, 97.5, 88, 75)")
SQL_query_insert

In [176]:
SQL_query_showa = executeSQL.execute('select * from student_marks')

In [177]:
INSERTVALS = [(2,'N Rao', 78, 89, 67, 56),
(3,'P Singh', 99, 88, 77, 66),
(4,'M Ram', 87, 87, 87 ,87)]
INSERTSTMT = 'insert into student_marks values(?,?,?,?,?,?)'
executeSQL.executemany(INSERTSTMT,INSERTVALS)
executeSQL.commit()

In [178]:
SQL_query_showa = executeSQL.execute('select * from student_marks')
resultset = SQL_query_showa.fetchall()
resultset

[(1, 'SRamanujan', 99.0, 97.5, 88.0, 75.0),
 (2, 'N Rao', 78.0, 89.0, 67.0, 56.0),
 (3, 'P Singh', 99.0, 88.0, 77.0, 66.0),
 (4, 'M Ram', 87.0, 87.0, 87.0, 87.0)]

In [181]:
df_std_mrks = pd.DataFrame(resultset,columns=list(zip(*SQL_query_showa.description))[0])
df_std_mrks

   id        name  math  science  social_std  english
0   1  SRamanujan  99.0     97.5        88.0     75.0
1   2       N Rao  78.0     89.0        67.0     56.0
2   3     P Singh  99.0     88.0        77.0     66.0
3   4       M Ram  87.0     87.0        87.0     87.0